tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/services"

brew "xz"
brew "bottom"
brew "cheat"
brew "ffmpeg"
brew "chromaprint"
brew "cmake"
brew "coreutils"
brew "curl"
brew "dockutil"
brew "eza"
brew "gcc"
brew "git"
brew "git-delta"
brew "gnupg"
brew "hub"
brew "jq"
brew "jql"
brew "mas"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "shellcheck"
brew "sk"
brew "starship"
brew "stow"
brew "task"
brew "tealdeer"
brew "xh"
brew "yt-dlp"
brew "zellij"

cask "1password"
cask "brave-browser"
cask "calibre"
cask "chatgpt"
cask "crossover"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "handbrake"
cask "hazel"
cask "iina"
cask "ivpn"
cask "parallels"
cask "qbittorrent"
cask "raycast"
cask "remnote"
cask "signal"
cask "tinymediamanager"
cask "visual-studio-code"
cask "xld"
cask "zotero"

mas "Amphetamine", id: 937984704
mas "Developer", id: 640199958
mas "Highlights", id: 1498912833
mas "Kindle", id: 302584613
mas "TestFlight", id: 899247664
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
mas "Yomu", id: 562211012

vscode "codeium.codeium"
vscode "ms-vscode.makefile-tools"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
